app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-10-19 04:53:44.003225"], ["updated_at", "2017-10-19 04:53:44.003225"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(params[:school_class])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-10-19 05:06:22.332735"], ["id", 1]]